app/Exports/BlogsExport.php

    public function collection()
    {
        $user = Auth::user();
        if ($user->hasRole('Admin')) {
            $blogs = Blog::with('user')
                ->get()
                ->map(function ($blog) {
                    return [
                        'title' => $blog->title,
                        'content' => $blog->content,
                        'author_name' => $blog->user->name, // Get author's name
                        'created_at' => $blog->created_at,
                    ];
                });
---
select * from `blogs`
select * from `users` where `users`.`id` in (105, 106)