app/Http/Controllers/Dashboard/Profile/RoleController.php

select * from `roles` order by `id` desc
select * from `permissions`
---
    public function index(Request $request)
    {
        $roles = Role::orderBy('id', 'DESC')->get();
        $permissions = Permission::get(); // 'id' as key, 'name' as value

select * from `roles` where `roles`.`id` = '31' limit 1
---
    public function update(Request $request, $id)
    {
        $this->validate($request, [
            'name' => 'required',
            'permission' => 'required',
        ]);
        $role = Role::find($id);