app/Http/Controllers/Dashboard/Profile/UserController.php

select * from `users`
select * from `roles`
---
    public function index()
    {
        try {
            if (auth()->user()->hasRole('Admin')) {
                $users = User::get();
                $roles = Role::get();

select * from `users` where `users`.`id` = '1' limit 1
---
    public function update(UserRequest $request, $id)
    {
        try {
            $user = User::FindOrFail($id);