app/Actions/Blogs/StoreBlogAction.php

    public function handle(array $data)
    {
        $blog = Blog::create(Arr::except($data, ['image']));
---
insert into `blogs` (`title`, `content`, `slug`, `user_id`, `updated_at`, `created_at`) values ('Possi', 'Ut de', 'one', '106', '2024-12-21 11:21:32', '2024-12-21 11:21:32')