app/View/Components/Dashboard/Layouts/Sidebar.php

select * from `sidebar` where `status` = 'Active' and `parent_id` is null
---
    public function __construct()
    {
        $this->parent = Sidebars::where('status','Active')->whereNull('parent_id')->with('child')->get();