app/Actions/Users/UpdateUserAction.php

update `users` set `password` = '$2y$10$V5WdPtB3pj33NHOZhDmYxOajFOTPnw3h4psAPbsA1GyAEi8nFMMpO', `users`.`updated_at` = '2024-12-21 00:09:23' where `id` = 1
delete from `model_has_roles` where `model_id` = 1
---
    public function handle(User $user, array $data)
    {
        $user->update(array_merge($data));
        DB::table('model_has_roles')->where('model_id', $user->id)->delete();