app/Http/Controllers/Dashboard/BlogsController.php

select * from `blogs` order by `id` desc
select * from `blogs` where `user_id` = 105 order by `id` desc
---
    public function index()
    {
        try {
            if (auth()->user()->hasRole('Admin')) {
                $blogs = Blog::orderBy('id', 'desc')->get();
            } elseif (auth()->user()->hasRole('Author')) {
                $blogs = Blog::where('user_id', auth()->user()->id)->orderBy('id', 'desc')->get();

select * from `blogs` where `blogs`.`id` = '1' limit 1
---
    public function update(BlogRequest $request, $id)
    {
        try {
            $blog = Blog::FindOrFail($id);

delete from `blogs` where `id` = 18
select * from `blogs` where `blogs`.`id` = '18' limit 1
---
    public function destroy(string $id)
    {
        try {
            Blog::FindOrFail($id)->delete();